Repository: janlay/brdisc-splitter
Catalog: Sources/BRDiscSplitter/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# app.quit
source: Quit BRDisc Splitter
zh_hans: 退出 BRDisc Splitter

# button.back
source: Back
zh_hans: 返回

# button.cancel
source: Cancel
zh_hans: 取消

# button.continue
source: Continue
zh_hans: 继续

# button.next
source: Next
zh_hans: 下一步

# button.newTask
source: New Task
zh_hans: 新任务

# button.openInFinder
source: Open in Finder
zh_hans: 在 Finder 中打开

# button.quit
source: Quit
zh_hans: 退出

# button.rescanAndContinue
source: Rescan and Continue
zh_hans: 重新扫描并继续

# button.running
source: Running...
zh_hans: 执行中...

# button.start
source: Start
zh_hans: 开始

# complete.dryRunSummary
source: Preview complete. %d files would be extracted.
zh_hans: 预览完成。计划提取 %d 个文件。

# complete.ended
source: The task has ended.
zh_hans: 任务已结束。

# complete.summary
source: Extracted %d files using %@ of disk space.
zh_hans: 已提取 %d 个文件，占用 %@ 磁盘空间。

# complete.title
source: Extraction Complete
zh_hans: 提取完成

# drop.browse
source: Browse
zh_hans: 浏览

# drop.chooseHelp
source: Choose an ISO file or Blu-ray directory
zh_hans: 选择 ISO 文件或蓝光目录

# drop.emptyTitle
source: Drop ISO or Blu-ray Directory
zh_hans: 拖入 ISO 或蓝光目录

# drop.input
source: Input
zh_hans: 输入

# error.extractionFailed
source: Extraction failed: exit code %d. Details are in the log.
zh_hans: 提取失败：退出码 %d。详细信息在日志中。

# field.cliScript
source: CLI Script
zh_hans: 命令行脚本

# field.mediaName
source: Media Name
zh_hans: 媒体名称

# field.mediaName.placeholder
source: Derived from input
zh_hans: 从输入路径推导

# field.outputDirectory
source: Output Directory
zh_hans: 输出目录

# intro.description
source: Extract movie or TV episode streams from Blu-ray sources without transcoding.
zh_hans: 从蓝光源中提取电影或剧集媒体流，不进行转码。

# intro.requirement
source: Prepare a .iso file, a Blu-ray root directory, or a BDMV directory before continuing.
zh_hans: 继续前请准备 .iso 文件、蓝光根目录或 BDMV 目录。

# language.label
source: Language
zh_hans: 语言

# log.clear
source: Clear Log
zh_hans: 清空日志

# log.copy
source: Copy Log
zh_hans: 复制日志

# log.empty
source: Waiting to run
zh_hans: 等待运行

# log.hide
source: Hide log area
zh_hans: 隐藏日志区域

# log.show
source: Show log area
zh_hans: 显示日志区域

# log.title
source: Output Log
zh_hans: 输出日志

# media.type.movie
source: Movie
zh_hans: 电影

# media.type.series
source: Series
zh_hans: 剧集

# media.type.unknown
source: Unknown
zh_hans: 未知

# mediaPlan.fileCount
source: %d files
zh_hans: %d 个文件

# mediaPlan.identifiedAs
source: Identified as: %@
zh_hans: 识别为：%@

# mediaPlan.remainingCount
source: %d more files
zh_hans: 另有 %d 个文件

# menu.cancel
source: Cancel
zh_hans: 取消

# menu.chooseInput
source: Choose Input...
zh_hans: 选择输入...

# menu.file
source: File
zh_hans: 文件

# menu.start
source: Start
zh_hans: 开始

# option.dryRun
source: Preview only
zh_hans: 仅预览

# option.episodeStart
source: Starting Episode
zh_hans: 起始集号

# option.jobs
source: Parallel Jobs
zh_hans: 并行任务

# option.minDuration
source: Minimum Duration
zh_hans: 最小时长

# option.noMediaDir
source: Skip media folder
zh_hans: 不创建媒体目录

# option.noSeasonDir
source: Skip season folder
zh_hans: 不创建季目录

# option.originalContainer
source: Keep original container
zh_hans: 保留原始容器

# option.originalContainer.description
source: Preserve the source extension such as .m2ts instead of remuxing to .mkv.
zh_hans: 保留源文件扩展名，例如 .m2ts，而不是重新封装为 .mkv。

# option.overwrite
source: Overwrite existing files
zh_hans: 覆盖已有文件

# option.overwrite.description
source: Replace existing output files instead of skipping them.
zh_hans: 遇到已存在的输出文件时重新写入，而不是跳过。

# option.outputSameAsISO
source: Same as .iso file
zh_hans: 与 .iso 文件相同

# option.outputSameAsISO.help
source: Use the folder that contains the selected .iso file.
zh_hans: 使用所选 .iso 文件所在目录作为输出目录。

# option.season
source: Season
zh_hans: 季号

# panel.cli.title
source: Choose brdisc-splitter Script
zh_hans: 选择 brdisc-splitter 脚本

# panel.input.title
source: Choose Blu-ray ISO or Directory
zh_hans: 选择蓝光 ISO 或目录

# panel.output.title
source: Choose Output Directory
zh_hans: 选择输出目录

# progress.extracting
source: Extracting
zh_hans: 正在提取

# progress.preview
source: Previewing
zh_hans: 正在预览

# progress.waiting
source: Waiting to start
zh_hans: 等待开始

# runner.error.busy
source: A task is already running.
zh_hans: 已有任务正在运行。

# section.advanced
source: Advanced
zh_hans: 高级

# status.canceling
source: Canceling
zh_hans: 正在取消

# status.extracting
source: Extracting
zh_hans: 正在提取

# status.failedWithCode
source: Failed: exit code %d
zh_hans: 失败：退出码 %d

# status.finished
source: Complete
zh_hans: 完成

# status.needRescan
source: Rescan required
zh_hans: 需要重新扫描

# status.planChangedRescan
source: Options changed. Rescan media content before continuing.
zh_hans: 选项已变更，继续前需要重新扫描媒体内容。

# status.planChangedRescanShort
source: Options changed. Rescan media content.
zh_hans: 选项已变更，请重新扫描媒体内容。

# status.previewing
source: Previewing
zh_hans: 正在预览

# status.ready
source: Ready
zh_hans: 就绪

# status.rescanningWithOptions
source: Rescanning with current options
zh_hans: 正在按当前选项重新扫描

# status.scanEmpty
source: No extractable media content was found.
zh_hans: 未能识别可提取的媒体内容。

# status.scanFailed
source: Scan failed
zh_hans: 扫描失败

# status.scanFailedWithCode
source: Scan failed: exit code %d
zh_hans: 扫描失败：退出码 %d

# status.scanningMedia
source: Scanning media content
zh_hans: 正在扫描媒体内容

# status.scanRecognized
source: Identified %d media files
zh_hans: 已识别 %d 个媒体文件

# summary.advanced
source: Advanced
zh_hans: 高级选项

# summary.autoDerived
source: Auto derived
zh_hans: 自动推导

# summary.common
source: Common
zh_hans: 常规选项

# summary.default
source: Default
zh_hans: 默认

# summary.episodeStart
source: E%@ start
zh_hans: E%@ 起

# summary.input
source: Input
zh_hans: 输入

# summary.jobs
source: %d jobs
zh_hans: %d 个并行任务

# summary.mediaName
source: Media Name
zh_hans: 媒体名称

# summary.minDuration
source: %d sec or longer
zh_hans: %d 秒以上

# summary.output
source: Output
zh_hans: 输出

# summary.type
source: Type
zh_hans: 类型

# unit.seconds
source: sec
zh_hans: 秒

# validation.cliNotFound
source: Could not find the brdisc-splitter CLI script.
zh_hans: 找不到 brdisc-splitter CLI 脚本。

# validation.cliPathRequired
source: CLI script path is required.
zh_hans: CLI 脚本路径不能为空。

# validation.episodeStartPositive
source: Starting episode must be greater than 0.
zh_hans: 起始集号必须大于 0。

# validation.inputInvalid
source: Input must be a .iso file or Blu-ray directory.
zh_hans: 输入必须是 .iso 文件或蓝光目录。

# validation.inputMissing
source: Input path does not exist.
zh_hans: 输入路径不存在。

# validation.inputRequired
source: Choose an input file or directory.
zh_hans: 请选择输入文件或目录。

# validation.jobsPositive
source: Parallel job count must be greater than 0.
zh_hans: 并行任务数必须大于 0。

# validation.minDurationPositive
source: Minimum duration must be greater than 0.
zh_hans: 最小时长必须大于 0。

# validation.seasonPositive
source: Season must be greater than 0.
zh_hans: 季号必须大于 0。

# validation.streamMissing
source: Could not find BDMV/STREAM in the input directory.
zh_hans: 输入目录中未找到 BDMV/STREAM。

# wizard.step.complete.count
source: Complete
zh_hans: 完成

# wizard.step.complete.title
source: Complete
zh_hans: 完成

# wizard.step.confirm.count
source: Step 4/4
zh_hans: 步骤 4/4

# wizard.step.confirm.title
source: Confirm and Extract
zh_hans: 确认并提取

# wizard.step.input.count
source: Step 2/4
zh_hans: 步骤 2/4

# wizard.step.input.title
source: Choose Input
zh_hans: 选择输入

# wizard.step.intro.count
source: Step 1/4
zh_hans: 步骤 1/4

# wizard.step.intro.title
source: Prepare
zh_hans: 准备

# wizard.step.options.count
source: Step 3/4
zh_hans: 步骤 3/4

# wizard.step.options.title
source: Set Options
zh_hans: 设置选项
